Revit 2026 API

# XYZNormalize Method

---

Returns a new XYZ whose coordinates are the normalized values from this vector.

**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 26.0.4.0 (26.0.4.0)

```csharp
public XYZ Normalize()
```
```vb
Public Function Normalize As XYZ
```
```cpp
public:
XYZ^ Normalize()
```
```fsharp
member Normalize : unit -> XYZ
```

#### Return Value

XYZThe normalized XYZ or zero if the vector is almost Zero.

Normalized indicates that the length of this vector equals one (a unit vector).

#### Reference

XYZ Class

Autodesk.Revit.DB Namespace